const districtMap = {
    "Балхашский": "Балхашский район",
    "Балхашский район": "Балхашский район",

    "Енбекшиказахский": "Енбекшиказахский район",
    "Енбекшиказахский район": "Енбекшиказахский район",

    "Илийский": "Илийский район",
    "Илийский район": "Илийский район",

    "Жамбылский": "Жамбылский район",
    "Жамбылский район": "Жамбылский район",

    "Карасайский": "Карасайский район",
    "Карасайский район": "Карасайский район",

    "Кегенский": "Кегенский район",
    "Кегенский район": "Кегенский район",

    "Райымбекский": "Райымбекский район",
    "Райымбекский район": "Райымбекский район",

    "Талгарский": "Талгарский район",
    "Талгарский район": "Талгарский район",

    "Уйгурский": "Уйгурский район",
    "Уйгурский район": "Уйгурский район",

    "г.Конаев": "г. Қонаев",
    "г. Конаев": "г. Қонаев",
    "Қонаев": "г. Қонаев",

    "г.Алатау": "г. Алатау",
    "г. Алатау": "г. Алатау",
    "Алатау": "г. Алатау"
};

const districtCenters = {
    "Балхашский район": [44.05, 76.95],
    "Енбекшиказахский район": [43.37, 77.42],
    "Илийский район": [43.72, 77.15],
    "Жамбылский район": [43.65, 76.55],
    "Карасайский район": [43.25, 76.85],
    "Кегенский район": [42.98, 79.22],
    "Райымбекский район": [42.68, 79.08],
    "Талгарский район": [43.30, 77.25],
    "Уйгурский район": [43.57, 79.94],
    "г. Қонаев": [43.866, 77.063],
    "г. Алатау": [43.58, 76.98]
};

function normalizeFinancing(text){

    if(!text) return "";

    text = text.toLowerCase();

    if(text.includes("брк")) return "БРК";

    if(text.includes("ско")) return "СКО";

    if(text.includes("заем")) return "Заемные средства";

    if(text.includes("соб")) return "Собственные средства";

    return text;
}

export async function loadProjects(){

    const response = await fetch("data/projects.json");

    const data = await response.json();

    return data.map(project=>{

        project.financing = normalizeFinancing(project.financing);

        project.district =
            districtMap[project.district?.trim()] ??
            project.district;

        if(!project.lat || !project.lng){

            const center =
                districtCenters[project.district];

            if(center){

                project.lat =
                    center[0] + (Math.random()-0.5)*0.08;

                project.lng =
                    center[1] + (Math.random()-0.5)*0.08;

            }

        }

        return project;

    });

}